%实验1：MILP与GA算法时间
%实验2：newyork流量
%topo：


[ha, pos] = tight_subplot(1,2,[.01 .15],[.2 .05],[.07 .02]);
%[ha, pos] = tight_subplot(行, 列, [上下间距,左右间距],[下边距,上边距 ], [左边距,右边距 ])

x1 = [18 15 10 8 6 5 4 3 2] / 18 * 100;
%MILP求解时间
y1_1 = [1.09 28.86 54.33 84.31 63.73 109.7 267.38 326.82 1024.22];
%GA算法时间
y1_2 =[22.536 22.847 21.880 20.850 19.775 18.214 18.050 17.855 18.35]
axes(ha(1));
plot(x1,y1_1,'m*-',x1,y1_2,'cd-')
legend('MILP','GA');  legend boxoff
xlabel('节点VM数量(p-%)');
ylabel('求解时间（S）');
set(gca,'XDir','reverse')


x2 = [1  2  3  4  5  6  7  8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28];
y2 = [8  5  3  6  5  4  5  5 6 5  8  8  9  13 14 12 10 6  8  5  11 5   3 2  5  6 8  7 ] * 2 /10;
axes(ha(2));
plot(x2,y2,'m*-') 
xlabel('时间（天）');
ylabel('流量占比');


